asciinema-git
bash-pipes
buku
byzanz-git
cava-git
cheat-git
console-solarized-git
dosfstools
discord
dropbox
emojione-color-font
google-chrome-dev
gtk-theme-solarc-git
haxor-news
hfsprogs
i3-gaps
i3blocks-gaps-git
imgp-git
imgurbash2
jrnl
la-capitaine-icon-theme-git
lutris
mcedit
mdp
megatools
minecraft
neofetch
neomutt
ninvaders
nodejs-how2
nodejs-svgo
nodejs-tldr-git
notify-send.sh
ntfs-3g
pass-import
python-natsort
python-urwidtrees-git
python3-kitchen
qt5-styleplugins
rofi-pass
rtv
ruby-bropages
ruby-jekyll
ruby-sass
rxvt-unicode-cvs-patched-wideglyphs
slacker
sparklines-git
srandrd
stig-git
sublime-text-dev
thunar-dropbox
tldr-git
tmuxinator
tmux-bash-completion
translate-shell
trash-cli-git
ttf-emojione-color
ttf-mac-fonts
ttf-ms-fonts
tty-clock-git
turses
urlscan-git
urxvt-fullscreen
urxvt-resize-font-git
urxvt-vtwheel
vimb
vitetris
vivaldi
xcalib
xcursor-osx-elcap
xscreensaver-aerial
yank
