tap 'homebrew/versions'
tap 'homebrew/dupes'

brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'grep'
brew 'git'
brew 'git-extras'

brew 'ansiweather'
brew 'asciinema'
brew 'atool'
brew 'bats'
brew 'boost'
brew 'buku'
brew 'cairo'
brew 'calcurse'
brew 'cmatrix'
brew 'cowsay'
brew 'dockutil'
brew 'ffmpeg', args: ['with-libcaca','with-libbluray','with-webp','with-x265','with-tesseract']
brew 'fftw'
brew 'figlet'
brew 'fontconfig'
brew 'fontforge', args: ['with-giflib','with-extra-tools']
brew 'fortune'
brew 'freetype'
brew 'fzf'
brew 'passy/givegif/givegif'
brew 'gnupg2'
brew 'go'
brew 'htop-osx'
brew 'httpie'
brew 'hub'
brew 'imagemagick', args: ['with-webp','with-x11','with-librsvg','with-openjpeg']
brew 'imessage-ruby'
brew 'jrnl'
brew 'leptonica'
brew 'lolcat'
brew 'mackup'
brew 'mas'
brew 'mdp'
brew 'mpd', args: ['with-flac','with-jack','with-pulseaudio']
brew 'mplayer', args: ['with-libcaca']
brew 'mps-youtube'
brew 'mpv', args: ['with-libcaca','with-libbluray','with-libaacs','with-pulseaudio','with-bundle']
brew 'mutt'
brew 'ncurses'
brew 'ncmpcpp', args: ['with-clock','with-outputs']
brew 'neofetch'
brew 'neomutt/homebrew-neomutt/neomutt', args: ['with-sidebar-patch', 'with-notmuch-patch']
brew 'neovim/neovim/neovim'
brew 'newsbeuter'
brew 'ninvaders'
brew 'openssl'
brew 'openvpn'
brew 'pango', args: ['with-x11']
brew 'pass'
brew 'poppler'
brew 'psgrep'
brew 'python'
brew 'ranger'
brew 'reattach-to-user-namespace'
brew 'remind'
brew 'ripgrep'
brew 'rtv'
brew 'ruby'
brew 'shellcheck'
brew 'sl'
brew 'spark'
brew 'ssh-copy-id'
brew 'streamlink'
brew 'surfraw'
brew 'terminal-notifier'
brew 'tesseract', args: ['with-serial-num-pack']
brew 'thefuck'
brew 'tldr'
brew 'tmux', args: ['with-utf8proc']
brew 'translate-shell'
brew 'transmission'
brew 'tree'
brew 'tty-clock'
brew 'typespeed'
brew 'vitetris'
brew 'vim', args: ['with-override-system-vi','with-custom-perl','with-custom-python','with-custom-ruby','with-lua','with-gettext']
brew 'w3m'
brew 'wget', args: ['with-gpgme']
brew 'yank'
brew 'youtube-dl'
brew 'zsh', args: ['with-unicode9']
brew 'zsh-completions'

cask_args appdir: '/Applications'
tap 'caskroom/cask'
brew 'cask'
tap 'caskroom/versions'

cask 'appcleaner'
cask 'dropbox'
cask 'duet'
cask 'fontforge'
cask 'google-chrome-canary'
cask 'handbrake'
cask 'karabiner-elements'
cask 'mamp'
cask 'minecraft'
cask 'poedit'
cask 'screens-connect'
cask 'scroll-reverser'
cask 'sitesucker'
cask 'sketch'
cask 'soundflower'
cask 'spectacle'
cask 'sublime-text'
cask 'virtualbox'
cask 'vivaldi'
cask 'xquartz'
cask 'xscreensaver'

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'quicklookase'
cask 'quicklook-pat'
cask 'qlvideo'
cask 'suspicious-package'

# mas '1Password'
# mas 'Affinity Designer'
# mas 'Affinity Photo'
# mas 'Clear'
# mas 'Display Menu'
# mas 'djay Pro'
# mas 'Final Cut Pro'
# mas 'Scapple'
# mas 'Ulysses'
